export const PLANETS_DATA = [
  {
    key: "planet1",
    name: "TRAPPIST-1 d",
    isVisited: false,
    position: {
      x: 200,
      y: 100,
    },
    properties: [
      {
        name: "حالة المياه",
        details: [
          "نظرا لوجودي في المنطقه الصالحه للسكن فهذا يعني انني قد املك الظروف المناسبه لتكون المياه السائله علي سطحي وهو امر حاسم للحياه",
          "غلافي الجوي إذا كان جديرًا باحتجاز الحرارة وتمكين توزيعها بالتساوي بين جانبيّ، قد أتمكن من إبقاء المياه في حالتها السائلة. حتى الآن، يعتقد العلماء بناءً على النماذج النظرية أنني قد أمتلك غلافًا جويًا رقيقًا أو معتدلًا.",
        ],
      },
      {
        name: "الغلاف الجوي",
        details: [
          "حتى الآن، يعتقد العلماء بناءً على النماذج النظرية أنني قد أمتلك غلافًا جويًا رقيقًا أو معتدلًا.",
        ],
      },
      {
        name: "الكتلة",
        details: [
          "كتلتي صغيرة، حوالي 0.388 من كتلة الأرض، لكن المفاجأة هي أن جاذبيتي تشبه جاذبية كوكب الأرض بما يكفي.",
        ],
      },
      {
        name: "درجة الحرارة",
        details: [
          "بسبب قيدي المداري، فإن مناخي متطرف جدًا، حيث تكون درجات الحرارة إما عالية جدًا على الجانب النهاري أو باردة جدًا على الجانب الليلي.",
        ],
      },
    ],
    testResult: "",
    background: "bg-1",
  },

  {
    key: "planet2",
    name: "TRAPPIST-1 e",
    isVisited: false,

    position: {
      x: 100,
      y: 900,
    },
    properties: [
      {
        name: "حالة المياه",
        details: [
          "وفقاً لوكالة ناسا، أنا واحد من أكثر الكواكب شبهًا بالأرض. خصائصي تجعلني مرشحًا واعدًا للحياة؛ فأنا كوكب صخري وأكثف من الأرض، مما يمنحني ميزة مهمة. كما أنني أقع في المنطقة الصالحة للحياة حول نجمي، مما يعني أنني قد أتمتع بظروف تسمح بوجود ماء سائل على سطحي.",
        ],
      },
      {
        name: "الغلاف الجوي",
        details: [
          "صحيح، لم تؤكد الدراسات وجود الماء بشكل مباشر حتى الآن، لكن احتمالية وجود غلاف جوي مشابه للأرض تزداد. لم تظهر الملاحظات وجود غلاف جوي غني بالهيدروجين مثل الكواكب الغازية، وهذا يعزز فرصتي في امتلاك غلاف جوي أكثر ملاءمة للحياة.",
        ],
      },
      {
        name: "الكتلة",
        details: [
          "كتلتي أقل قليلاً من كتلة الأرض، لكن بفضل كثافتي العالية، فإن جاذبيتي قريبة جدًا من جاذبية الأرض. هذا يجعلني الأفضل لدعم غلاف جوي مستقر وربما حتى وجود ماء سائل.",
        ],
      },
      {
        name: "درجة الحرارة",
        details: [
          "أتلقى فقط %٦٠ من الطاقة الشمسية التي تحصل عليها الأرض، وبناءً على ذلك يُتوقع أن تكون درجة حرارة سطحي أقل من درجة حرارة الأرض. لكن وجود غلاف جوي مناسب قد يساعد في تعديل الحرارة لدعم وجود الماء السائل.",
        ],
      },
    ],
    testResult: "",
    background: "bg-2",
  },
  {
    key: "planet3",
    name: "Kepler-186f",
    isVisited: false,

    position: {
      x: 1800,
      y: 800,
    },
    properties: [
      {
        name: "حالة المياه",
        details: [
          "بالرغم من وقوعي في المنطقة الصالحة للحياة حول نجمي، يظل السؤال قائمًا حول ما إذا كنت أتمتع بغلاف جوي كثيف كافٍ لدعم وجود الماء السائل.",
        ],
      },
      {
        name: "الغلاف الجوي",
        details: [
          "بالرغم من وقوعي في المنطقة الصالحة للحياة حول نجمي، يظل السؤال قائمًا حول ما إذا كنت أتمتع بغلاف جوي كثيف كافٍ لدعم وجود الماء السائل.",
        ],
      },
      {
        name: "الكتلة",
        details: [
          "بالرغم من طبيعتي الصخرية، إلا أن كتلتي غير معروفة بدقة حتى الآن، لكن يعتقد العلماء أن جاذبيتي قد تكون مشابهة لجاذبية الأرض أو أقل قليلاً.",
        ],
      },
      {
        name: "درجة الحرارة",
        details: [
          "ببساطة، أتعرض لطاقة أقل من تلك التي تتلقاها الأرض، بالرغم من أنني أعيش في المنطقة الصالحة للحياة حول نجمي.",
        ],
      },
    ],
    testResult: "",
    background: "bg-3",
  },
  {
    key: "planet4",
    name: "planet4",
    isVisited: false,

    position: {
      x: 1850,
      y: 0,
    },
    properties: [
      {
        name: "حالة المياه",
        details: [
          "بالرغم من وقوعي في المنطقة الصالحة للحياة حول نجمي، يظل السؤال قائماً حول ما إذا كنت أتمتع بغلاف جوي كثيف كافٍ لدعم وجود الماء السائل.",
        ],
      },
      {
        name: "الغلاف الجوي",
        details: [
          "بالرغم من وقوعي في المنطقة الصالحة للحياة حول نجمي، يظل السؤال قائماً حول ما إذا كنت أتمتع بغلاف جوي كثيف كافٍ لدعم وجود الماء السائل.",
        ],
      },
      {
        name: "الكتلة",
        details: [
          "بالرغم من طبيعتي الصخرية، إلا أن كتلتي غير معروفة بدقة حتى الآن. ومع ذلك، يعتقد العلماء أن جاذبيتي قد تكون مشابهة لجاذبية الأرض أو أقل قليلاً.",
        ],
      },
      {
        name: "درجة الحرارة",
        details: [
          "يعتقد العلماء انني أتلقى طاقة أقل من تلك التي تتلقاها الأرض.",
        ],
      },
    ],
    testResult: "",
    background: "bg-4",
  },
  {
    key: "planet5",
    name: "Kepler-452b",
    isVisited: false,
    position: {
      x: 900,
      y: 50,
    },
    properties: [
      {
        name: "حالة المياه",
        details: [
          "أعتبر مرشحًا جيدًا لوجود الماء السائل على سطحي بفضل موقعي حول نجمي.",
        ],
      },
      {
        name: "الغلاف الجوي",
        details: [
          "وجود احتمال كبير لوجود غلاف جوي سميك يساعد في تنظيم درجة حرارتي ودعم الحياة.",
        ],
      },
      {
        name: "الكتلة",
        details: [
          "كتلتي أكبر بحوالي % من كتلة كوكب الأرض، مما يعني أن جاذبيتي أكبر، وبالتالي يؤثر ذلك سلبًا على استدامة الحياة.",
        ],
      },
      {
        name: "درجة الحرارة",
        details: [
          "أنا Kepler-452b، كوكب يدور حول Kepler-452، وهو أقرب النجوم من حيث الحرارة والحجم إلى شمسكم. لذلك، فإن الظروف المناخية قد تكون مشابهة لتلك على الأرض.",
        ],
      },
    ],
    testResult: "",
    background: "bg-5",
  },
];
